{
    "articles":[
        {"id":"1","title":"Глава I: Базовые концепции","content":"<p>Чтобы начать изучение бизнесс-анализа, нам нужно сначала договориться о некоторых общих терминах, чтобы мы могли понимать друг друга.</p><h3>Стейкхолдеры</h3><p><b>Стейкхолдеры</b> — это любые люди или организации, которые могут оказать влияние на ваш продукт или проект или могут подвергнуться влиянию вашего продукта или проекта. Прежде всего, давайте их классифицируем.</p><p><i>Платящий стейкхолдер</i> — представитель компании, которая платит за ваш проект, например, владелец продукта или менеджер продукта (Product Owner, Product Manager), возможно менеджер проекта (Project Manager), который отвечает за бюджет и принимает решение о продолжении финансирования, он заинтересован в реальном бизнес-результате, потому что он платит деньги, и если результатов не будет — вас уволят. К этому же типу стейкхолдеров можно отнести акционеров компании, поскольку они могут покупать, держать или продавать акции и голосовать за решения в совете директоров в зависимости от финансовых результатов компании. Вероятно, они также могут позволить себе купить стейк (steak), но на английском стейкхолдер пишется по-другому (stakeholders).</p><p><i>SME (Subject Matter Expert)</i> — эксперт предметной области, сотрудник, который много знает о бизнесе или системе, может помочь в ней разобраться, он может более не быть связан с продуктом напрямую, но он много знает о продукте и может дать ответы на вопросы о том, как система сторилась и каковы были ожидания от той или иной функциональности.</p><p><i>Команда разработки</i> — они выполняют работу, очень важно информировать их о том, что на самом деле нужно и почему, это ваша работа как бизнес-аналитика.</p><p><i>Команда поддержки</i> — если она есть, люди, которые помогают пользователям использовать систему, исправляют конфигурацию. Им нужно знать, как функционирует продукт, чтобы они могли помогать пользователям.</p><p><i>Конечные пользователи</i> — это люди, которые, в конечном счете, принимают решение об использовании вашего продукта. Именно пользователи генерируют прибыль, и на основе их поведения <b>платящий стейкхолдер</b> определяет ваше будущее.</p><p><i>Правительство</i> — правительство не только требуют от вас платить налоги, но и постоянно придумывают новые правила, о которых вы должны знать, и они не будут вас об этом информировать, поэтому вам лучше следить за заголовками новостей, чтобы не оказаться в тюрьме или не заплатить большой штраф.</p><p><i>Активисты и лоббисты</i> — попробуйте подумать обо всех НКО, которые пытаются подать на вас в суд.</p><p><i>Конкуренты</i> — другие компании, разрабатывающие аналогичный продукт или работающие в том же направлении, которые могут переманить ваших клиентов.</p><p><i>Поставщики и продавцы</i> — другие компании, помогающие бизнесу, могут быть фактическими поставщиками товаров или услуг, например, таким поставщиком услуг можно назвать клининговую компанию, аудитора, других поставщиков ПО.</p><h3>Типы требований</h3><h4>Функциональные и нефункциональные</h4><p><i>Функциональные требования (Functional Requirements - FR)</i> — описание ожиданий того, как должна повести себя система, в основном, в тех случая, когда пользователь совершает какое-то действие. Если при обсуждении требований кто-то говорит вам, что пользователь вообще не вовлечен в процесс, то этот кто-то, скорее всего, не знает о чем он говорит.  Даже если есть автоматическое задание, которое запускается по графику, причиной существования этого задания является использование результатов этого задания пользователем. <i>Пример:</i> допустим, есть цены,  которые наша система извлекает из стороннего API и сохраняет их в базе данных раз в день — эти цены будут использоваться при расчете стоимости заказа, когда пользователь его сформирует.</p><p><i>Нефункциональные требования (Non-Functional Requirements - NFR)</i> — описание ожиданий относительно того, как система должна работать в програмной среде — это требования к производительности (страница должна открываться в течение 3 секунд,  эндпойнт должен быть способен обрабатывать  100 000 записей одновременно), требования к  програмному обеспечению  (приложение должно быть доступно на iOS и Android,  сайт должен работать в IE11  (пожалуйста, скажите мне, что таких требований больше нет)),  требования к переводу (сайт должен быть доступен на испанском языке  — это требование все еще считается нефункциональным, но возможность переключения между языками  уже является функциональным требованием,  поскольку требует внешнего воздействия — действия пользователя),  требования к UX — например, соответствие HIPPA (Health Insurance Portability and Accountability Act - скажем 'привет', типу стейкхолдеров <i>правительство</i>),  когда от вас требуется предоставить аудиочитаемую версию сайта.</p><h4>Бизнес-требования и Системные требования</h4><p><i>Требования стейкхолдеров</i> — плохо сформулированные (возможно даже неправильно сформулированные) фрагменты предложений и мыслей, которые должен обработать бизнес-аналитик. В основном это проблемы бизнеса (например, «Я не знаю, пользователи будто игнорируют нашу новую страницу с прогнозом погоды, можем ли мы сделать большую красную кнопку, которая вела бы их туда прямо с лендинга?»)</p><p><i>Бизнес-требования</i> — ваш домен, эти требования должны быть хорошо структурированы, должны описывать, как работает система. («добавьте кнопку в центр главной страницы, следуйте дизайну, описанному в Figma (ссылка на источник); только пользователи, подписанные на план B, могут видеть эту кнопку и эту страницу; когда пользователь нажимает на кнопку, он перенаправляется на страницу с прогнозом погоды и видит ...»; и т. д.).</p><p>Кстати, приведенные выше требрвания - это не шаблон, мы поговорим о лучших способах написания требований в будущих главах этого курса. Я хотел бы подчеркнуть, что создание прототипа определенно является частью бизнес-требований, это подготовка к выявлению требований, такая же как и написание критериев приемки и поиск пропущенных сценариев.</p><p><i>Системные требования</i> — описание взаимодействия компонентов системы в результате действий пользователя. В спецификации системных требований (System Requirements Specification - SRS) такие требования называют требованиями к внешнему интерфейсу и системным функциям. Это в основном описание того, как система должна работать с другими системами или как компоненты одной системы взаимодействуют друг с другом, например,если у вас есть API эндпойнт, работу которого нужно задокументировать, вам нужно определить тело запроса и ответа, для каждого поля в теле запроса и ответа вам нужно определить тип данных, длинну, если это применимо (например для строчного типа данных, для десятичного типа данных), является ли поле обязательным или нет, какие валидации существуют для поля. Если информация хранится в базе данных, необходимо определить сопоставление полей базы данных с полями в запросе. Если информация передается в другую систему или извлекается другой системой, вам нужно определить сопоставление ваших полей с полями сторонего приложения (например, если информация передается между двумя микросервисами). Если информация периодически должна обновляться, как часто это должно происходить? Если возвращается много данных, должен ли эндпойнт поддерживать пагинацию? Должно ли быть ограничение по частоте запросов (rate limit). Если есть несколько вызовов между несколькими системами, используйте нотации UML или BPMN для визуализации последовательности выполненных вызовов и ожидаемых ответов. Если в бизнес-требованиях указано несколько состояний бизнес-объектов, сделайте себе одолжение и создайте диаграмму переходов состояний (state transition diagram), чтобы найти отсутствующие состояния и триггеры, которые приводят к переходу из одного состояния в другое.<p><p>Существует множество других классификаций, которые можно взять из IEEE/ISO, BABOK или книги Карла Вигерса.</p><h3>Выявление требований</h3><p><i>Выявление или cбор требований</i> — это этап в процессе бизнесс-анализа, когда аналитик собирает требования и пытается понять, какие требования вообще существуют, прежде чем записывать их. Существует множество методов:<ul><li>Интервью со стейкхолдерами</li><li>Мозговой штурм со стейкхолдерами</li><li>Интервью с пользователями</li><li>Наблюдение за поведением пользователей</li><li>Создание прототипов</li><li>Обзор и анализ документации и законодательства</li></ul></p><h3>Персоны и роли пользователей</h3><p>Существуют различные группы пользователей, в UX их также называют персонами — чтобы обозначить социальные различия в группах пользователей, обычно в одном приложении выделяются разные роли пользователей — Обычный пользователь, Администратор, Пользователь с подпиской А, Пользователь с подпиской Б. Если мы говорим о персонах — мы говорим о демографическом описании — вот пользователь Тим, ему около 25 лет, у него хорошее здоровье и он зарабатывает меньше денег, Джиму 45–50, он регулярно ходит к врачу и у него больше сбережений, чем у Тима, и т. д.</p><h3>Глоссарий</h3><p>Это буквально то, что вы читаете сейчас, и он должен быть в каждом хорошем проекте — глоссарий общих терминов по проекту, чтобы все говорили на одном языке, это особенно полезно,когда стейкхолдеры используют разные термины для одного и того же бизнес-объекта.</p><h3>User Story (Пользовательская история)</h3><p>Это шаблон для написания требований, в котором обязательно должны присутствовать роль пользователя, требуемая функция и ценность, которую пользователь получит от этой функции. <i>Пример:</i> Как <b><i>администратор приложения</i></b>, я хочу иметь возможность <b><i>добавлять статьи на главную страницу приложения</b></i>, чтобы <b><i>пользователь мог их прочитать</b></i>.</p><h3>Use Case</h3><p>Вариант использования системы — сценарий с пользовательским вводом и последовательностью действий системы, которые происходят из-за этого ввода.    <ol>        <li>Пользователь открывает главную страницу</li>        <li>Пользователь видит большую красную кнопку</li>        <li>Пользователь нажимает большую красную кнопку</li>        <li>Пользователь перенаправляется на такую-то страницу</li>    </ol></p><h3>Приемочное тестирование (Acceptance Testing)</h3><p>Тестирование, проводимое аналитиком перед развертыванием функционала в среде (environment), доступной заказчику или пользователю (PROD, UAT, Stage — существует множество названий для таких сред)</p><h3>Приемочное тестирование пользователем (User Acceptance Testing)</h3><p>Тестирование, проводимое пользователями в специально предназначенной для этого среде. Такая среда как раз может называться UAT или Stage.</p><h3>Release Notes</h3><p>Вместе с релизом в PROD стейкхолдерам отправляют документ, в котором перечислены все изменения, внесенные в релиз.</p><h3>Базовая документация</h3><p>Это статьи на wiki, Confluence, Sharepoint или любом другом инструменте, который может хранить общую информацию о функциональности продукта. Такая документация обязательно должна существовать, если ее нет, задача бизнесс аналитика будет заключаться в том, чтобы ее создать и поддерживать, она должна включать обзор проекта, диаграммы и схемы архитектуры.</p>"},
        {"id":"2","title":"Глава II: Что такое хорошие требования?","content":"<section><p>Требования — это фундамент любого проекта разработки. От их качества напрямую зависит успех реализации: сроки, бюджет и соответствие конечного продукта ожиданиям заказчика. В эпоху ИИ требования становятся еще важнее - теперь этот текст зачастую воспринимает не разработчик, а большая языковая модель, чем лучше будут тербования, тем лучше будет результат, инженеру останется больше времени для проектирования системы. В этой главе мы разберём, что делает требования «хорошими», опираясь на авторитетные источники: книгу Карла Вигерса «Разработка требований к ПО», стандарты IEEE/ISO, а также методики INVEST и SMART.</p></section><section>    <h2>Определение требования</h2> <p>В стандарте <strong>ISO/IEC/IEEE 29148:2011 4.1.17</strong> требования определяются как утверждение, которое толкует или выражает потребность, а также связанные с ней ограничения и условия (\"statement which translates or expresses a need and its associated constraints and conditions\").</p></section><section> <h2>Критерии хороших требований (по Карлу Вигерсу, глава 5)</h2>    <p>Карл Вигерс в книге «Разработка требований к программному обеспечению» выделяет следующие ключевые характеристики        качественных требований:</p>    <ul>        <li><strong>Единичность</strong> — требование описывает одну и только одну вещь.</li>        <li><strong>Завершённость</strong> — содержит всю необходимую информацию для понимания и реализации.</li>        <li><strong>Последовательность</strong> — не противоречит другим требованиям и документации.</li>        <li><strong>Атомарность</strong> — неделимо на более мелкие требования без потери смысла.</li>        <li><strong>Отслеживаемость</strong> — можно проследить связь с бизнес-целями и другими артефактами проекта.        </li>        <li><strong>Актуальность</strong> — остаётся релевантным на протяжении жизненного цикла проекта.</li>        <li><strong>Выполнимость</strong> — технически реализуемо в рамках заданных ограничений.</li>        <li><strong>Недвусмысленность</strong> — формулировка не допускает разночтений.</li>        <li><strong>Проверяемость</strong> — существует способ проверить выполнение требования.</li>    </ul></section><section>    <h2>Методика INVEST: критерии пользовательских историй</h2>    <p>Для Agile-подходов популярна методика <strong>INVEST</strong>, предложенная Биллом Уэйком. Она задаёт критерии        качества пользовательских историй:</p>    <ul>        <li><strong>I (Independent)</strong> — независимость: история не должна зависеть от других историй.</li>        <li><strong>N (Negotiable)</strong> — обсуждаемость: описание — не контракт, а повод для обсуждения.</li>        <li><strong>V (Valuable)</strong> — ценность: приносит пользу пользователю или бизнесу.</li>        <li><strong>E (Estimable)</strong> — оцениваемость: можно оценить трудозатраты.</li>        <li><strong>S (Small)</strong> — компактность: достаточно мала для реализации в одном спринте.</li>        <li><strong>T (Testable)</strong> — проверяемость: есть критерии приёмки.</li>    </ul></section><section>    <h2>Метод SMART: критерии формулировки требований</h2>    <p>Принцип <strong>SMART</strong> помогает сформулировать требования так, чтобы они были пригодны для реализации:    </p>    <ul>        <li><strong>S (Specific)</strong> — конкретность: чёткое описание, что нужно сделать.</li>        <li><strong>M (Measurable)</strong> — измеримость: есть критерии проверки выполнения.</li>        <li><strong>A (Achievable)</strong> — достижимость: технически реализуемо.</li>        <li><strong>R (Relevant)</strong> — актуальность: соответствует бизнес-целям.</li>        <li><strong>T (Time-bound)</strong> — ограниченность по времени: понятны сроки реализации.</li>    </ul></section><section>    <h2>Как понять, что требования готовы к передаче в разработку</h2>    <p>Перед передачей требований команде разработки проведите чек-лист проверки:</p>    <ol>        <li><strong>Полнота</strong>: все ли сценарии и граничные случаи учтены?</li>        <li><strong>Ясность</strong>: поймёт ли разработчик требование без дополнительных вопросов?</li>        <li><strong>Согласованность</strong>: нет ли противоречий с другими требованиями?</li>        <li><strong>Приоритеты</strong>: определены ли приоритеты (например, можно использовать технику MoSCoW: Must have, Should have, Could            have, Won't have, или просто High, Medium, Low)?</li>        <li><strong>Критерии приёмки</strong>: есть ли чёткие условия, по которым можно проверить выполнение?</li>        <li><strong>Зависимости</strong>: учтены ли внешние системы или компоненты?</li>        <li><strong>Риски</strong>: идентифицированы ли потенциальные проблемы реализации?</li>    </ol></section><section>    <h2>Типичные ошибки в требованиях</h2>    <ul>        <li>Неоднозначные формулировки. <i>Пример: </i> «пользователь должен легко найти…» - здесь не ясно что значит легко, каков критерий легкости?.</li><li>Требования-решения вместо требований-целей. <i>Пример: </i> «В новом поле в базе данных в таблице Orders конкатенируйте поля Id и ShortCode через дефис…» - зачем нужно это поле в базе, может нужно просто отдавать его в ответе API? Или даже просто показывать в пользовательском интерфейсе?</li>        <li>Отсутствие критериев проверки. <i>Пример: </i>«система должна быть быстрой» - про что это требование? Может быть про открытие страницы, насколько быстро в таком случае она должна открываться - 3 минуты, 3 секунды? При каком количестве одновременных пользователей? </li>        <li>Избыточная детализация на раннем этапе.</li>        <li>Несогласованность с бизнес-целями.</li>    </ul></section><section>    <p>Хорошие требования — это баланс между детализацией и гибкостью, точностью и понятностью. Опираясь на стандарты        IEEE/ISO, подходы Вигерса, INVEST и SMART, можно создать основу для успешной разработки:</p>    <ul>        <li>Проверяйте требования по критериям качества.</li>        <li>Вовлекайте команду в обсуждение для устранения неясностей.</li>        <li>Документируйте критерии приёмки.</li>        <li>Поддерживайте актуальность требований в процессе разработки.</li>    </ul>    <p>Только качественно сформулированные требования позволяют минимизировать риски, сократить затраты и создать        продукт, который действительно решает задачи пользователей.</p></section>"},
        {"id":"3","title":"Глава III: Что делать на новом проекте?","content":"<section><p>Начало работы над новым проектом — критический этап для бизнес‑аналитика. Перед вами — чёткий план действий на старте.</p></section><section><h3>Шаг 1. Анализ стейкхолдеров</h3>    <p>Aнализ стейкхолдеров позволяет:</p>    <ul><li>определить ключевые источники требований;</li>        <li>выстроить коммуникацию;</li>        <li>предвосхитить конфликты интересов;</li>        <li>распределить ответственность.</li>    </ul>    <h4>Как провести анализ</h4>    <ol>        <li><strong>Идентификация.</strong> Составьте список всех возможных стейкхолдеров: заказчики, пользователи, регуляторы, команда, смежные подразделения. Простого списка будет вполне достаточно. С именами и позициями вам может помочь ваше контакое лицо по проекту, лучше всех будет знать SME, но для этого его нужно идентифицировать.</li>        <li><strong>Классификация.</strong> Разделите стейкхолдеров на группы:            <ul>                <li>внутренние / внешние;</li>                <li>первичные (прямое влияние) / вторичные;</li>                <li>поддерживающие / сопротивляющиеся.</li>            </ul>    <p>Для классификации первичных и вторичных стейкхолдеров очень хорошо подойдет Onion-диаграмма</p><img width=\"500px\" height=\"500px\" alt=\"Example of onion diagram\" src=\"onion.png\"><p><i>Пример Onion-диаграммы</i></p>    </li>        <li><strong>Оценка интересов и влияния.</strong> Используйте Power Interest Grid для того, чтобы выбрать стартегию поведения со стейкхолдером: <table border=\"1rem\" cellpadding=\"5\">                <tr><th>Stakeholder</th><th>Power</th><th>Interest</th><th>Strategy</th></tr><tr><th>Buying customer</th><th>High Power</th><th>High interest</th><th>Manage closely</th></tr><tr><th>Platform holder</th><th>Low Power</th><th>Low interest</th><th>Monitor</th></tr><tr><th>Enduser</th><th>High Power</th><th>Low interest</th><th>Keep satisfied</th></tr><tr><th>Development team</th><th>Low Power</th><th>High interest</th><th>Keep informed</th></tr></table><p><img width=\"500px\" height=\"500px\" alt=\"Example of Power Interest Grid\" src=\"powerinterest.png\"></p><p><i>Пример Power Interst Grid</i></p> </li>        <li><strong>Планирование взаимодействия.</strong> Выделите для себя ключевых стейкхолдеров и определите как часто и каким образом вы будете с ними общаться, будет ли это на регулярных общих встречах, 2 раза в неделю на рефайнментах бэклога, или каждую неделю на 1-1, нужно ли приглашать менеджера заказчика на ежедневные встречи, нужно ли отправлять отчеты и если да, то в какой форме их принято отправлять. Все это можно выявить на личных встречах. </section><section>    <h3>Шаг 2. Создание глоссария</h3><p>Глоссарий — словарь терминов проекта. Он устраняет разночтения и ускоряет коммуникацию. Первая глава наглядно иллюстрирует такого рода глоссарий.</p>    <h3>Что включать</h3>    <ul>        <li>отраслевые термины (например, «лид», «конверсия» в маркетинге);</li>        <li>названия систем и модулей;</li>        <li>аббревиатуры и сокращения;</li>        <li>специфические для компании понятия.</li>    </ul>    <h3>Как составлять</h3>    <ol>        <li>Выделите термины из первых интервью и документов.</li>        <li>Согласуйте определения со стейкхолдерами.</li>        <li>Укажите синонимы и примеры использования.</li>        <li>Обновляйте по мере появления новых понятий.</li>    </ol>  </section><section>    <h3>Шаг 3. Базовая документация</h3>    <p>На старте сформируйте минимальный набор документов. Он станет фундаментом для дальнейшей работы.</p><h3>Обязательные документы</h3><ol><li><strong>Устав проекта</strong> <p>Кратко отвечает на вопросы:</p><ul><li>Зачем проект нужен? (цели, бизнес‑ценность)</li><li>Что будет сделано? (границы, результаты)</li><li>Кто участвует? (в принципе, работа по анализу стейкхолдеров закрывает этот пункт)</li><li>Когда? (сроки, этапы, примерный roadmap, если есть, если нет, его нужно выяснить у стейкхолдеров)</li><li>Какие есть ограничения? (бюджет, ресурсы)</li></ul>  <p>Eсли у вас в команде есть архиткетор, или опытный тех лид, возможно SME с техническим бэкграундом, свяжитесь с ним и нарисуйте диаграмму продукта и его взаимосвязи с другими продуктами, например, можно использовать нотацию С4 для описания архитектуры системы.</p>      </li>        <li>            <strong>Список требований (Baseline Requirements)</strong>            <p>Таблица с требованиями. Колонки:</p>            <ul>                <li>ID требования;</li><li>Заголовок;</li><li>Описание</li><li>Критерии приемки</li></ul><p>Таблица с требованиями должна копировать все требования из тикетов в вашей системе управления проектом, которые уже были задеплоены в прод. Вы можете организовать ее в wiki, Conflunce, Sharepoint, Word, Git - репозитории, главное чтобы они были в едином месте, так удобнее понимать текущее состояние проекта, еще лучше было бы отслеживать в этом же документе, как одни требования отменяют или расширяют другие. Конечно, не обязательно копировать требования дословно, можно суммаризировать их и делать более короткими.</p> </li>        <li>            <strong>Протокол встреч (Meeting Minutes)</strong>            <p>После каждой встречи всегда фиксируйте:</p>            <ul>                <li>дату и участников;</li>                <li>ключевые решения;</li>                <li>действия и ответственных;</li>                <li>открытые вопросы.</li>            </ul><p>Теперь ИИ ассистенты могу делать большую часть такой работы за вас, так что не теряйте шанс использовать их.</p></li>        <li>            <strong>Риски и проблемы (Risk Log)</strong>            <p>Таблица с колонками:</p>            <ul>                <li>Описание риска;</li>                <li>Вероятность наступления - выскоая, средняя, низкая;</li>                <li>Степень влияния на проект - высокая, средняя,низкая;</li>                <li>Меры - описание мероприятий для предотвращения или снижения риска;</li>                <li>Ответственный;</li>            </ul>        </li>    </ol>    <div >        <strong>Совет:</strong> Не стремитесь к идеальности на старте. Документы должны быть «живыми» — обновляйте их по мере поступления информации, показывайте их другим участникам команды для обсуждения.    </div></section><section>    <h2>Чек-лист первых 2 недель</h2>    <p>Чтобы не упустить важное, следуйте плану:</p>    <ol>        <li>Проведите вводные встречи с ключевыми стейкхолдерами.</li>        <li>Составьте первичный список стейкхолдеров и матрицу влияния.</li>        <li>Начните заполнять глоссарий на основе первых обсуждений.</li>        <li>Оформите устав проекта (даже в черновике).</li>        <li>Заведите список требований — внесите первые 5–10 пунктов.</li>        <li>Фиксируйте все встречи и решения в протоколах.</li>        <li>Идентифицируйте ключевые риски.</li>    </ol></section>"},
        {"id":"4","title":"title4","content":"<p>content4</p>"},
        {"id":"5","title":"title5","content":"<p>content5</p>"},
        {"id":"6","title":"title6","content":"<p>content6</p>"},
        {"id":"7","title":"title7","content":"<p>content7</p>"},
        {"id":"8","title":"title8","content":"<p>content8</p>"},
        {"id":"9","title":"title9","content":"<p>content9</p>"},
        {"id":"10","title":"title10","content":"<p>content10</p>"},
        {"id":"11","title":"title11","content":"<p>content11</p>"},
        {"id":"12","title":"title12","content":"<p>content12</p>"}
    ]
}