{
    "articles":[
        {"id":"1","title":"Глава I: Базовые концепции","content":"<p>Чтобы начать изучение бизнесс-анализа, нам нужно сначала договориться о некоторых общих терминах, чтобы мы могли понимать друг друга.</p><p><b>Стейкхолдеры</b> — это любые люди или организации, которые могут оказать влияние на ваш продукт или проект или могут подвергнуться влиянию вашего продукта или проекта. Прежде всего, давайте их классифицируем.</p><p><i>Платящий стейкхолдер</i> — представитель компании, которая платит за ваш проект, например, PO или VP или PM, который владеет бюджетом, принимает решение о продолжении финансирования, он заинтересован в реальном бизнес-результате, потому что он платит деньги,и если результатов не будет — вас уволят. Это также акционеры, поскольку они могут покупать, держать или продавать акции и голосовать за решения в совете директоров. Вероятно, они также могут позволить себе купить стейк.</p><p> <i>SME (Subject Matter Expert)</i> — эксперт предметной области, сотрудник, который много знает о бизнесе или системе и может помочь, он может больше не быть заинтересован в проекте или продукте напрямую, но он много знает и ему можно задавать вопросы о том, как система сторилась и какие были ожидания от той или иной функциональности.</p><h4>Команда разработчиков</h4> <p>— они выполняют работу, и жизненно важно информировать их о том, что на самом деле нужно и почему, это ваша работа как бизнес-аналитика.</p><h4>Команда поддержки</h4> — если она есть, люди, которые помогают пользователям справляться. Им нужно знать, как функционирует продукт, чтобы они могли помогать пользователям.<h4>Конечные пользователи/покупатели</h4> <p>— это люди, которые принимают решение, хорош продукт или нет, и генерируют прибыль, и на основе их поведения Плательщик-участник определит ваше будущее.</p><h4>Правительство</h4> <p>— эти ребята не только требуют от вас платить налоги, но и постоянно придумывают новые правила, о которых вы должны знать, и они не будут вас об этом информировать, поэтому вам лучше следить за заголовками новостей, чтобы не оказаться в тюрьме или не заплатить большой штраф.</p><h4>Активисты и лоббисты</h4> <p>— попробуйте подумать обо всех НКО, которые пытаются подать на вас в суд, потому что вы считаете их правыми или потому что их попросил об этом конкурент.</p><h4>Конкуренты</h4> <p>— другие компании, производящие аналогичную продукцию или работающие в том же направлении, которые могут переманить ваших клиентов.</p><h4>Поставщики и продавцы</h4> <p>— другие компании, помогающие бизнесу, могут быть фактическими поставщиками товаров или услуг,  такими как клининговая компания или аудиторы, или, скорее,  другими поставщиками ИТ.</p><h3>Типы требований</h3><h4>Функциональные и нефункциональные</h4><p><b>Функциональные требования (FR)</b> — описание ожиданий того, как должна функционировать система, в основном то, что происходит в системе, когда есть какое-то действие от пользователя, и если кто-то говорит, что пользователя нет, то они либо лгут вам, не знают, о чем говорят,  либо пытаются сократить путь, разговаривая с вами.  Даже если есть автоматическое задание,  которое запускается время от времени,  триггером для использования его результата  является действие пользователя, то есть есть цены,  которые наша система извлекает из стороннего API  и сохраняет их раз в день — эти цены будут использоваться  при расчете счета, когда пользователь разместит заказ.</p><p><b>Нефункциональные требования (NFR)</b> — описание ожиданий относительно того, как система должна работать в среде — это требования к производительности (страница должна открываться в течение 3 секунд,  конечная точка должна быть способна обрабатывать  100 000 записей одновременно), требования к среде  (приложение должно быть доступно на iOS и Android,  сайт должен работать в IE11  (пожалуйста, скажите мне, что таких требований больше нет)),  требования к переводу (сайт должен быть доступен на испанском языке  — видите ли, это NFR, но возможность переключения между языками  уже является функциональным требованием,  поскольку требует внешнего участия — действия пользователя),  требования к UX — например, соответствие HIPPA  (привет, заинтересованные стороны правительства),  когда от вас требуется предоставить аудиочитаемую версию сайта.</p><h4>Требования к бизнесу и системе</h4><p><b>Требования стейкхолдеров</b> — плохо сформированные (возможно, даже неправильно сформированные) фрагменты предложений и мыслей, которые должен обработать бизнес-аналитик. В основном это проблемы бизнеса (например, «Я не знаю, пользователи как бы игнорируют нашу новую функцию прогноза погоды на основе ИИ, можем ли мы сделать большую красную кнопку прямо на целевой странице»)</p><p><b>Бизнес-требования</b> — ваш домен, они должны быть хорошо структурированы, должны описывать, как работает система. («добавьте кнопку в центр целевой страницы, следуя дизайну, представленному в прикрепленном файле Figma; только пользователи, зарегистрированные на уровне B, могут видеть это сообщение, поскольку они платят за конечные точки ИИ в OpenAI; когда пользователь нажимает на эту кнопку, он перенаправляется на страницу с прогнозом погоды на основе ИИ и видит ...»; и т. д.).</p><p>Кстати, это не шаблон, мы поговорим о лучших способах написания требований в будущих разделах этой книги. Я хотел бы подчеркнуть, что создание прототипа определенно является частью бизнес-требований, а также подготовкой себя к их определению путем написания критериев приемки и поиска пропущенных случаев (диаграмма вариантов использования также полезна для этой цели).</p><p><b>Системные требования</b> — описание взаимодействия компонентов системы в результате действий пользователя, еще один уровень ниже бизнес-требований. В SRS их часто называют требованиями к внешнему интерфейсу и системными функциями. Это в основном описание того, как система должна работать с другими системами или как компоненты одной системы взаимодействуют друг с другом, например,если у вас есть конечная точка API для описания, вам нужно определить полезную нагрузку запроса и/или ответа,для каждого поля этой полезной нагрузки вам нужно определить тип и длину, если применимо.Если информация хранится в базе данных, необходимо определить сопоставление полей базы данных.Если информация передается в другую систему или извлекается другой системой, вам нужно определить сопоставление ваших полей со сторонними полями.Если информация извлекается, какова должна быть частота? Если возвращается много данных, должна ли быть пагинация? Должно ли быть ограничение по частоте.Какие проверки необходимо выполнить при вызове бэкэнда?Если есть несколько вызовов между несколькими системами, используйте нотации UML или BPMN для визуализации последовательности выполненных вызовов и ожидаемых результатов.Если в бизнес-требованиях указано несколько состояний бизнес-объектов, сделайте себе одолжение и создайте диаграмму переходов состояний, чтобы найти отсутствующие состояния и триггеры, которые приводят к переходу из одного состояния в другое.<p><p>Существует множество других классификаций, которые можно взять из IEEE/ISO, BABOK или требований  к программному обеспечению Карла Вигера.</p><h3>Выявление требований</h3><p>Выявление или обнаружение — это этап в процессе BA, когда BA собирает требования и пытается понять, какие требования существуют, прежде чем записывать их. Существует множество методов:<li>Интервью с заинтересованными сторонами</li><li>Семинар с заинтересованными сторонами</li><li>Интервью с пользователями</li><li>Наблюдение за поведением пользователей</li><li>Создание прототипов</li><li>Обзор и анализ документации и законодательства</li></p><h3>Персоны и роли пользователей</h3><p>Различные группы пользователей, в UX их также называют персонами — чтобы обозначить социальные различия в группах пользователей, обычно в одном приложении у вас будут разные роли пользователей — Обычный пользователь, Администратор, Пользователь с планом А, Пользователь с планом Б. Если мы говорим о персонах — мы говорим о демографическом описании — вот пользователь Тим, ему 23–25 лет, у него хорошее здоровье и он зарабатывает меньше денег,Джиму 45–50, он регулярно ходит к врачу и у него больше сбережений,чем у Тима, и т. д.</p><h3>Глоссарий</h3><p>Это буквально то, что я здесь делаю, и он должен быть в каждом хорошем проекте — глоссарий общих терминов по проекту,чтобы все говорили на одном языке, это особенно полезно,когда заинтересованные стороны используют разные термины для одного и того же бизнес-объекта.</p><h3>История пользователя</h3><p>Шаблонное требование, в котором указана роль пользователя, необходимая функция и ценность, которую пользователь получит от нее.Как администратор приложения, я хочу иметь возможность добавлять статьи на главную страницу приложения, чтобы пользователь мог их прочитать.</p><h3>Use Case</h3><p>Вариант использования системы — сценарий с пользовательским вводом и последовательностью действий системы, которые происходят из-за этого ввода.    <ol>        <li>Пользователь открывает главную страницу</li>        <li>Пользователь видит большую красную кнопку</li>        <li>Пользователь нажимает большую красную кнопку</li>        <li>Пользователь перенаправляется на красную страницу</li>    </ol></p><h3>Приемочное тестирование</h3><p>Тестирование, проводимое аналитиком перед перемещением функции в следующую среду (среда PROD, среда UAT, среда Stage — для этого существует множество сред и множество терминов)</p><h3>Приемочное тестирование пользователем</h3><p>Тестирование, проводимое пользователями в среде pre-Prod. pre-Prod env можно снова назвать UAT env, Stage env, Test env, но в идеале должна быть некоторая среда до prod, где пользователи могут поиграть с новой функциональностью</p><h3>Release Notes</h3><p>Вместе с релизом в производственный отдел отправляется документ, в котором перечислены все изменения, внесенные в релиз.</p><h3>Базовая документация</h3><p>Это статьи на wiki, Confluence, Sharepoint или любом другом инструменте, который может хранить общую информацию о функциональности продукта. Должен существовать, а если нет, то он должен быть настроен и поддерживаться BA, включая обзор проекта, диаграммы и схемы архитектуры.</p>"},
        {"id":"2","title":"title2","content":"content2"},
        {"id":"4","title":"title1","content":"<p>content1</p><b>hello</b>"},
        {"id":"5","title":"title1","content":"<p>content1</p><b>hello</b>"},
        {"id":"6","title":"title1","content":"<p>content1</p><b>hello</b>"},
        {"id":"7","title":"title1","content":"<p>content1</p><b>hello</b>"},
        {"id":"8","title":"title8","content":"<p>content1</p><b>hello</b>"}
    ]
}